//【问题描述】求用户输入的两个数的和与积。


//程序运行结果如下：

//请输入两个数：12.5 83.8

//12.5+83.8=96.3

//12.5*83.8=1047.5

//【输入形式】

//  两个数。

//【输出形式】

//加法算式及结果

//乘法算式及结果

//【样例输入】

//请输入两个数：12.5 83.8

//【样例输出】12.5+83.8=96.3
//12.5*83.8=1047.5

#include <iostream>
using namespace std;
int main()
{
    double a, b;
    cout << "请输入两个数：";
    cin >> a >> b;
    
    double sum = a + b;
    double mul = a * b;
    cout << a << "+" << b << "=" << sum <<endl;
    cout << a << "*" << b << "=" << mul <<endl;
    
    return 0;
}
