//【问题描述】编写一个程序，求父亲和儿子的年龄各是多少？假设父亲和儿子的年龄之和为55，年龄之差为27。

//程序运行结果如下（下划线部分是用户输入的数据）：

//请输入父子的年龄和与年龄差：55 27

//求得父亲41岁，儿子14岁。

//【输入形式】

//输入提示信息（中文文字和冒号）和以一个空格间隔的两个整数（西文数字和空格）。

//【输出形式】

//两个整数，父亲的年龄和儿子的年龄。中文文字和符号，文字与数字之间无任何空格。

//【样例输入】

//请输入父子的年龄和与年龄差：55 27

//【样例输出】

//求得父亲41岁，儿子14岁。

#include <iostream>
using namespace std;

int main(int argc, char** argv) {
	int sum, diff;
	cout << "请输入父子的年龄和与年龄差：";
	cin >> sum >> diff;

	int father = (sum + diff) / 2;
	int son = sum - father;

	cout << "求得父亲" << father << "岁，儿子" << son << "岁。" << endl;
	return 0;
}

